Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 256, 256, 3) 0                                            
__________________________________________________________________________________________________
block1_conv1 (Conv2D)           (None, 256, 256, 64) 1792        input_1[0][0]                    
__________________________________________________________________________________________________
block1_conv2 (Conv2D)           (None, 256, 256, 64) 36928       block1_conv1[0][0]               
__________________________________________________________________________________________________
block1_pool (MaxPooling2D)      (None, 128, 128, 64) 0           block1_conv2[0][0]               
__________________________________________________________________________________________________
block2_conv1 (Conv2D)           (None, 128, 128, 128 73856       block1_pool[0][0]                
__________________________________________________________________________________________________
block2_conv2 (Conv2D)           (None, 128, 128, 128 147584      block2_conv1[0][0]               
__________________________________________________________________________________________________
block2_pool (MaxPooling2D)      (None, 64, 64, 128)  0           block2_conv2[0][0]               
__________________________________________________________________________________________________
block3_conv1 (Conv2D)           (None, 64, 64, 256)  295168      block2_pool[0][0]                
__________________________________________________________________________________________________
block3_conv2 (Conv2D)           (None, 64, 64, 256)  590080      block3_conv1[0][0]               
__________________________________________________________________________________________________
block3_conv3 (Conv2D)           (None, 64, 64, 256)  590080      block3_conv2[0][0]               
__________________________________________________________________________________________________
block3_conv4 (Conv2D)           (None, 64, 64, 256)  590080      block3_conv3[0][0]               
__________________________________________________________________________________________________
block3_pool (MaxPooling2D)      (None, 32, 32, 256)  0           block3_conv4[0][0]               
__________________________________________________________________________________________________
block4_conv1 (Conv2D)           (None, 32, 32, 512)  1180160     block3_pool[0][0]                
__________________________________________________________________________________________________
block4_conv2 (Conv2D)           (None, 32, 32, 512)  2359808     block4_conv1[0][0]               
__________________________________________________________________________________________________
block4_conv3 (Conv2D)           (None, 32, 32, 512)  2359808     block4_conv2[0][0]               
__________________________________________________________________________________________________
block4_conv4 (Conv2D)           (None, 32, 32, 512)  2359808     block4_conv3[0][0]               
__________________________________________________________________________________________________
block4_pool (MaxPooling2D)      (None, 16, 16, 512)  0           block4_conv4[0][0]               
__________________________________________________________________________________________________
block5_conv1 (Conv2D)           (None, 16, 16, 512)  2359808     block4_pool[0][0]                
__________________________________________________________________________________________________
block5_conv2 (Conv2D)           (None, 16, 16, 512)  2359808     block5_conv1[0][0]               
__________________________________________________________________________________________________
block5_conv3 (Conv2D)           (None, 16, 16, 512)  2359808     block5_conv2[0][0]               
__________________________________________________________________________________________________
block5_conv4 (Conv2D)           (None, 16, 16, 512)  2359808     block5_conv3[0][0]               
__________________________________________________________________________________________________
average_pooling2d (AveragePooli (None, 1, 1, 512)    0           block5_conv4[0][0]               
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 1, 1, 64)     32832       average_pooling2d[0][0]          
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 1, 1, 64)     256         conv2d[0][0]                     
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 16, 16, 64)   32768       block5_conv4[0][0]               
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 16, 16, 64)   294912      block5_conv4[0][0]               
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 16, 16, 64)   294912      block5_conv4[0][0]               
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 16, 16, 64)   294912      block5_conv4[0][0]               
__________________________________________________________________________________________________
activation (Activation)         (None, 1, 1, 64)     0           batch_normalization[0][0]        
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 16, 16, 64)   256         conv2d_1[0][0]                   
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 16, 16, 64)   256         conv2d_2[0][0]                   
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 16, 16, 64)   256         conv2d_3[0][0]                   
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 16, 16, 64)   256         conv2d_4[0][0]                   
__________________________________________________________________________________________________
up_sampling2d (UpSampling2D)    (None, 16, 16, 64)   0           activation[0][0]                 
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 16, 16, 64)   0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 16, 16, 64)   0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 16, 16, 64)   0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 16, 16, 64)   0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 16, 16, 320)  0           up_sampling2d[0][0]              
                                                                 activation_1[0][0]               
                                                                 activation_2[0][0]               
                                                                 activation_3[0][0]               
                                                                 activation_4[0][0]               
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 16, 16, 64)   20480       concatenate[0][0]                
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 16, 16, 64)   256         conv2d_5[0][0]                   
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 16, 16, 64)   0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
up_sampling2d_1 (UpSampling2D)  (None, 32, 32, 64)   0           activation_5[0][0]               
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 32, 32, 576)  0           up_sampling2d_1[0][0]            
                                                                 block4_conv4[0][0]               
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 32, 32, 256)  1327360     concatenate_1[0][0]              
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 32, 32, 256)  1024        conv2d_6[0][0]                   
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 32, 32, 256)  0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 32, 32, 256)  590080      activation_6[0][0]               
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 32, 32, 256)  1024        conv2d_7[0][0]                   
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 32, 32, 256)  0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 256)          0           activation_7[0][0]               
__________________________________________________________________________________________________
reshape (Reshape)               (None, 1, 1, 256)    0           global_average_pooling2d[0][0]   
__________________________________________________________________________________________________
dense (Dense)                   (None, 1, 1, 32)     8192        reshape[0][0]                    
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 1, 1, 256)    8192        dense[0][0]                      
__________________________________________________________________________________________________
multiply (Multiply)             (None, 32, 32, 256)  0           activation_7[0][0]               
                                                                 dense_1[0][0]                    
__________________________________________________________________________________________________
up_sampling2d_2 (UpSampling2D)  (None, 64, 64, 256)  0           multiply[0][0]                   
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 64, 64, 512)  0           up_sampling2d_2[0][0]            
                                                                 block3_conv4[0][0]               
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 64, 64, 128)  589952      concatenate_2[0][0]              
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 64, 64, 128)  512         conv2d_8[0][0]                   
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 64, 64, 128)  0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 64, 64, 128)  147584      activation_8[0][0]               
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 64, 64, 128)  512         conv2d_9[0][0]                   
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 64, 64, 128)  0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
global_average_pooling2d_1 (Glo (None, 128)          0           activation_9[0][0]               
__________________________________________________________________________________________________
reshape_1 (Reshape)             (None, 1, 1, 128)    0           global_average_pooling2d_1[0][0] 
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 1, 1, 16)     2048        reshape_1[0][0]                  
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 1, 1, 128)    2048        dense_2[0][0]                    
__________________________________________________________________________________________________
multiply_1 (Multiply)           (None, 64, 64, 128)  0           activation_9[0][0]               
                                                                 dense_3[0][0]                    
__________________________________________________________________________________________________
up_sampling2d_3 (UpSampling2D)  (None, 128, 128, 128 0           multiply_1[0][0]                 
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 128, 128, 256 0           up_sampling2d_3[0][0]            
                                                                 block2_conv2[0][0]               
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 128, 128, 64) 147520      concatenate_3[0][0]              
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 128, 128, 64) 256         conv2d_10[0][0]                  
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 128, 128, 64) 0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 128, 128, 64) 36928       activation_10[0][0]              
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 128, 128, 64) 256         conv2d_11[0][0]                  
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 128, 128, 64) 0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
global_average_pooling2d_2 (Glo (None, 64)           0           activation_11[0][0]              
__________________________________________________________________________________________________
reshape_2 (Reshape)             (None, 1, 1, 64)     0           global_average_pooling2d_2[0][0] 
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 1, 1, 8)      512         reshape_2[0][0]                  
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 1, 1, 64)     512         dense_4[0][0]                    
__________________________________________________________________________________________________
multiply_2 (Multiply)           (None, 128, 128, 64) 0           activation_11[0][0]              
                                                                 dense_5[0][0]                    
__________________________________________________________________________________________________
up_sampling2d_4 (UpSampling2D)  (None, 256, 256, 64) 0           multiply_2[0][0]                 
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 256, 256, 128 0           up_sampling2d_4[0][0]            
                                                                 block1_conv2[0][0]               
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 256, 256, 32) 36896       concatenate_4[0][0]              
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 256, 256, 32) 128         conv2d_12[0][0]                  
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 256, 256, 32) 0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 256, 256, 32) 9248        activation_12[0][0]              
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 256, 256, 32) 128         conv2d_13[0][0]                  
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 256, 256, 32) 0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
global_average_pooling2d_3 (Glo (None, 32)           0           activation_13[0][0]              
__________________________________________________________________________________________________
reshape_3 (Reshape)             (None, 1, 1, 32)     0           global_average_pooling2d_3[0][0] 
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 1, 1, 4)      128         reshape_3[0][0]                  
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 1, 1, 32)     128         dense_6[0][0]                    
__________________________________________________________________________________________________
multiply_3 (Multiply)           (None, 256, 256, 32) 0           activation_13[0][0]              
                                                                 dense_7[0][0]                    
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 256, 256, 1)  33          multiply_3[0][0]                 
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 256, 256, 1)  0           conv2d_14[0][0]                  
__________________________________________________________________________________________________
tf.math.multiply (TFOpLambda)   (None, 256, 256, 3)  0           input_1[0][0]                    
                                                                 activation_14[0][0]              
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 256, 256, 32) 896         tf.math.multiply[0][0]           
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 256, 256, 32) 128         conv2d_15[0][0]                  
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 256, 256, 32) 0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 256, 256, 32) 9248        activation_15[0][0]              
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 256, 256, 32) 128         conv2d_16[0][0]                  
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 256, 256, 32) 0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
global_average_pooling2d_4 (Glo (None, 32)           0           activation_16[0][0]              
__________________________________________________________________________________________________
reshape_4 (Reshape)             (None, 1, 1, 32)     0           global_average_pooling2d_4[0][0] 
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 1, 1, 4)      128         reshape_4[0][0]                  
__________________________________________________________________________________________________
dense_9 (Dense)                 (None, 1, 1, 32)     128         dense_8[0][0]                    
__________________________________________________________________________________________________
multiply_4 (Multiply)           (None, 256, 256, 32) 0           activation_16[0][0]              
                                                                 dense_9[0][0]                    
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 128, 128, 32) 0           multiply_4[0][0]                 
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 128, 128, 64) 18496       max_pooling2d[0][0]              
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 128, 128, 64) 256         conv2d_17[0][0]                  
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 128, 128, 64) 0           batch_normalization_16[0][0]     
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 128, 128, 64) 36928       activation_17[0][0]              
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 128, 128, 64) 256         conv2d_18[0][0]                  
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 128, 128, 64) 0           batch_normalization_17[0][0]     
__________________________________________________________________________________________________
global_average_pooling2d_5 (Glo (None, 64)           0           activation_18[0][0]              
__________________________________________________________________________________________________
reshape_5 (Reshape)             (None, 1, 1, 64)     0           global_average_pooling2d_5[0][0] 
__________________________________________________________________________________________________
dense_10 (Dense)                (None, 1, 1, 8)      512         reshape_5[0][0]                  
__________________________________________________________________________________________________
dense_11 (Dense)                (None, 1, 1, 64)     512         dense_10[0][0]                   
__________________________________________________________________________________________________
multiply_5 (Multiply)           (None, 128, 128, 64) 0           activation_18[0][0]              
                                                                 dense_11[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 64, 64, 64)   0           multiply_5[0][0]                 
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 64, 64, 128)  73856       max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 64, 64, 128)  512         conv2d_19[0][0]                  
__________________________________________________________________________________________________
activation_19 (Activation)      (None, 64, 64, 128)  0           batch_normalization_18[0][0]     
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 64, 64, 128)  147584      activation_19[0][0]              
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 64, 64, 128)  512         conv2d_20[0][0]                  
__________________________________________________________________________________________________
activation_20 (Activation)      (None, 64, 64, 128)  0           batch_normalization_19[0][0]     
__________________________________________________________________________________________________
global_average_pooling2d_6 (Glo (None, 128)          0           activation_20[0][0]              
__________________________________________________________________________________________________
reshape_6 (Reshape)             (None, 1, 1, 128)    0           global_average_pooling2d_6[0][0] 
__________________________________________________________________________________________________
dense_12 (Dense)                (None, 1, 1, 16)     2048        reshape_6[0][0]                  
__________________________________________________________________________________________________
dense_13 (Dense)                (None, 1, 1, 128)    2048        dense_12[0][0]                   
__________________________________________________________________________________________________
multiply_6 (Multiply)           (None, 64, 64, 128)  0           activation_20[0][0]              
                                                                 dense_13[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 32, 32, 128)  0           multiply_6[0][0]                 
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 32, 32, 256)  295168      max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, 32, 32, 256)  1024        conv2d_21[0][0]                  
__________________________________________________________________________________________________
activation_21 (Activation)      (None, 32, 32, 256)  0           batch_normalization_20[0][0]     
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 32, 32, 256)  590080      activation_21[0][0]              
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, 32, 32, 256)  1024        conv2d_22[0][0]                  
__________________________________________________________________________________________________
activation_22 (Activation)      (None, 32, 32, 256)  0           batch_normalization_21[0][0]     
__________________________________________________________________________________________________
global_average_pooling2d_7 (Glo (None, 256)          0           activation_22[0][0]              
__________________________________________________________________________________________________
reshape_7 (Reshape)             (None, 1, 1, 256)    0           global_average_pooling2d_7[0][0] 
__________________________________________________________________________________________________
dense_14 (Dense)                (None, 1, 1, 32)     8192        reshape_7[0][0]                  
__________________________________________________________________________________________________
dense_15 (Dense)                (None, 1, 1, 256)    8192        dense_14[0][0]                   
__________________________________________________________________________________________________
multiply_7 (Multiply)           (None, 32, 32, 256)  0           activation_22[0][0]              
                                                                 dense_15[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 16, 16, 256)  0           multiply_7[0][0]                 
__________________________________________________________________________________________________
average_pooling2d_1 (AveragePoo (None, 1, 1, 256)    0           max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 1, 1, 64)     16448       average_pooling2d_1[0][0]        
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, 1, 1, 64)     256         conv2d_23[0][0]                  
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 16, 16, 64)   16384       max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 16, 16, 64)   147456      max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
conv2d_26 (Conv2D)              (None, 16, 16, 64)   147456      max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
conv2d_27 (Conv2D)              (None, 16, 16, 64)   147456      max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
activation_23 (Activation)      (None, 1, 1, 64)     0           batch_normalization_22[0][0]     
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (None, 16, 16, 64)   256         conv2d_24[0][0]                  
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, 16, 16, 64)   256         conv2d_25[0][0]                  
__________________________________________________________________________________________________
batch_normalization_25 (BatchNo (None, 16, 16, 64)   256         conv2d_26[0][0]                  
__________________________________________________________________________________________________
batch_normalization_26 (BatchNo (None, 16, 16, 64)   256         conv2d_27[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_5 (UpSampling2D)  (None, 16, 16, 64)   0           activation_23[0][0]              
__________________________________________________________________________________________________
activation_24 (Activation)      (None, 16, 16, 64)   0           batch_normalization_23[0][0]     
__________________________________________________________________________________________________
activation_25 (Activation)      (None, 16, 16, 64)   0           batch_normalization_24[0][0]     
__________________________________________________________________________________________________
activation_26 (Activation)      (None, 16, 16, 64)   0           batch_normalization_25[0][0]     
__________________________________________________________________________________________________
activation_27 (Activation)      (None, 16, 16, 64)   0           batch_normalization_26[0][0]     
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (None, 16, 16, 320)  0           up_sampling2d_5[0][0]            
                                                                 activation_24[0][0]              
                                                                 activation_25[0][0]              
                                                                 activation_26[0][0]              
                                                                 activation_27[0][0]              
__________________________________________________________________________________________________
conv2d_28 (Conv2D)              (None, 16, 16, 64)   20480       concatenate_5[0][0]              
__________________________________________________________________________________________________
batch_normalization_27 (BatchNo (None, 16, 16, 64)   256         conv2d_28[0][0]                  
__________________________________________________________________________________________________
activation_28 (Activation)      (None, 16, 16, 64)   0           batch_normalization_27[0][0]     
__________________________________________________________________________________________________
up_sampling2d_6 (UpSampling2D)  (None, 32, 32, 64)   0           activation_28[0][0]              
__________________________________________________________________________________________________
concatenate_6 (Concatenate)     (None, 32, 32, 832)  0           up_sampling2d_6[0][0]            
                                                                 block4_conv4[0][0]               
                                                                 multiply_7[0][0]                 
__________________________________________________________________________________________________
conv2d_29 (Conv2D)              (None, 32, 32, 256)  1917184     concatenate_6[0][0]              
__________________________________________________________________________________________________
batch_normalization_28 (BatchNo (None, 32, 32, 256)  1024        conv2d_29[0][0]                  
__________________________________________________________________________________________________
activation_29 (Activation)      (None, 32, 32, 256)  0           batch_normalization_28[0][0]     
__________________________________________________________________________________________________
conv2d_30 (Conv2D)              (None, 32, 32, 256)  590080      activation_29[0][0]              
__________________________________________________________________________________________________
batch_normalization_29 (BatchNo (None, 32, 32, 256)  1024        conv2d_30[0][0]                  
__________________________________________________________________________________________________
activation_30 (Activation)      (None, 32, 32, 256)  0           batch_normalization_29[0][0]     
__________________________________________________________________________________________________
global_average_pooling2d_8 (Glo (None, 256)          0           activation_30[0][0]              
__________________________________________________________________________________________________
reshape_8 (Reshape)             (None, 1, 1, 256)    0           global_average_pooling2d_8[0][0] 
__________________________________________________________________________________________________
dense_16 (Dense)                (None, 1, 1, 32)     8192        reshape_8[0][0]                  
__________________________________________________________________________________________________
dense_17 (Dense)                (None, 1, 1, 256)    8192        dense_16[0][0]                   
__________________________________________________________________________________________________
multiply_8 (Multiply)           (None, 32, 32, 256)  0           activation_30[0][0]              
                                                                 dense_17[0][0]                   
__________________________________________________________________________________________________
up_sampling2d_7 (UpSampling2D)  (None, 64, 64, 256)  0           multiply_8[0][0]                 
__________________________________________________________________________________________________
concatenate_7 (Concatenate)     (None, 64, 64, 640)  0           up_sampling2d_7[0][0]            
                                                                 block3_conv4[0][0]               
                                                                 multiply_6[0][0]                 
__________________________________________________________________________________________________
conv2d_31 (Conv2D)              (None, 64, 64, 128)  737408      concatenate_7[0][0]              
__________________________________________________________________________________________________
batch_normalization_30 (BatchNo (None, 64, 64, 128)  512         conv2d_31[0][0]                  
__________________________________________________________________________________________________
activation_31 (Activation)      (None, 64, 64, 128)  0           batch_normalization_30[0][0]     
__________________________________________________________________________________________________
conv2d_32 (Conv2D)              (None, 64, 64, 128)  147584      activation_31[0][0]              
__________________________________________________________________________________________________
batch_normalization_31 (BatchNo (None, 64, 64, 128)  512         conv2d_32[0][0]                  
__________________________________________________________________________________________________
activation_32 (Activation)      (None, 64, 64, 128)  0           batch_normalization_31[0][0]     
__________________________________________________________________________________________________
global_average_pooling2d_9 (Glo (None, 128)          0           activation_32[0][0]              
__________________________________________________________________________________________________
reshape_9 (Reshape)             (None, 1, 1, 128)    0           global_average_pooling2d_9[0][0] 
__________________________________________________________________________________________________
dense_18 (Dense)                (None, 1, 1, 16)     2048        reshape_9[0][0]                  
__________________________________________________________________________________________________
dense_19 (Dense)                (None, 1, 1, 128)    2048        dense_18[0][0]                   
__________________________________________________________________________________________________
multiply_9 (Multiply)           (None, 64, 64, 128)  0           activation_32[0][0]              
                                                                 dense_19[0][0]                   
__________________________________________________________________________________________________
up_sampling2d_8 (UpSampling2D)  (None, 128, 128, 128 0           multiply_9[0][0]                 
__________________________________________________________________________________________________
concatenate_8 (Concatenate)     (None, 128, 128, 320 0           up_sampling2d_8[0][0]            
                                                                 block2_conv2[0][0]               
                                                                 multiply_5[0][0]                 
__________________________________________________________________________________________________
conv2d_33 (Conv2D)              (None, 128, 128, 64) 184384      concatenate_8[0][0]              
__________________________________________________________________________________________________
batch_normalization_32 (BatchNo (None, 128, 128, 64) 256         conv2d_33[0][0]                  
__________________________________________________________________________________________________
activation_33 (Activation)      (None, 128, 128, 64) 0           batch_normalization_32[0][0]     
__________________________________________________________________________________________________
conv2d_34 (Conv2D)              (None, 128, 128, 64) 36928       activation_33[0][0]              
__________________________________________________________________________________________________
batch_normalization_33 (BatchNo (None, 128, 128, 64) 256         conv2d_34[0][0]                  
__________________________________________________________________________________________________
activation_34 (Activation)      (None, 128, 128, 64) 0           batch_normalization_33[0][0]     
__________________________________________________________________________________________________
global_average_pooling2d_10 (Gl (None, 64)           0           activation_34[0][0]              
__________________________________________________________________________________________________
reshape_10 (Reshape)            (None, 1, 1, 64)     0           global_average_pooling2d_10[0][0]
__________________________________________________________________________________________________
dense_20 (Dense)                (None, 1, 1, 8)      512         reshape_10[0][0]                 
__________________________________________________________________________________________________
dense_21 (Dense)                (None, 1, 1, 64)     512         dense_20[0][0]                   
__________________________________________________________________________________________________
multiply_10 (Multiply)          (None, 128, 128, 64) 0           activation_34[0][0]              
                                                                 dense_21[0][0]                   
__________________________________________________________________________________________________
up_sampling2d_9 (UpSampling2D)  (None, 256, 256, 64) 0           multiply_10[0][0]                
__________________________________________________________________________________________________
concatenate_9 (Concatenate)     (None, 256, 256, 160 0           up_sampling2d_9[0][0]            
                                                                 block1_conv2[0][0]               
                                                                 multiply_4[0][0]                 
__________________________________________________________________________________________________
conv2d_35 (Conv2D)              (None, 256, 256, 32) 46112       concatenate_9[0][0]              
__________________________________________________________________________________________________
batch_normalization_34 (BatchNo (None, 256, 256, 32) 128         conv2d_35[0][0]                  
__________________________________________________________________________________________________
activation_35 (Activation)      (None, 256, 256, 32) 0           batch_normalization_34[0][0]     
__________________________________________________________________________________________________
conv2d_36 (Conv2D)              (None, 256, 256, 32) 9248        activation_35[0][0]              
__________________________________________________________________________________________________
batch_normalization_35 (BatchNo (None, 256, 256, 32) 128         conv2d_36[0][0]                  
__________________________________________________________________________________________________
activation_36 (Activation)      (None, 256, 256, 32) 0           batch_normalization_35[0][0]     
__________________________________________________________________________________________________
global_average_pooling2d_11 (Gl (None, 32)           0           activation_36[0][0]              
__________________________________________________________________________________________________
reshape_11 (Reshape)            (None, 1, 1, 32)     0           global_average_pooling2d_11[0][0]
__________________________________________________________________________________________________
dense_22 (Dense)                (None, 1, 1, 4)      128         reshape_11[0][0]                 
__________________________________________________________________________________________________
dense_23 (Dense)                (None, 1, 1, 32)     128         dense_22[0][0]                   
__________________________________________________________________________________________________
multiply_11 (Multiply)          (None, 256, 256, 32) 0           activation_36[0][0]              
                                                                 dense_23[0][0]                   
__________________________________________________________________________________________________
conv2d_37 (Conv2D)              (None, 256, 256, 1)  33          multiply_11[0][0]                
__________________________________________________________________________________________________
activation_37 (Activation)      (None, 256, 256, 1)  0           conv2d_37[0][0]                  
__________________________________________________________________________________________________
concatenate_10 (Concatenate)    (None, 256, 256, 2)  0           activation_14[0][0]              
                                                                 activation_37[0][0]              
==================================================================================================
Total params: 29,297,570
Trainable params: 29,290,274
Non-trainable params: 7,296
__________________________________________________________________________________________________

